# Словарь Морзе
MorseCode = {
        'A': '.-',
        'B': '-...',
        'C': '-.-.',
        'D': '-..',
        'E': '.',
        'F': '..-.',
        'G': '--.',
        'H': '....',
        'I': '..',
        'J': '.---',
        'K': '-.-',
        'L': '.-..',
        'M': '--',
        'N': '-.',
        'O': '---',
        'P': '.--.',
        'Q': '--.-',
        'R': '.-.',
        'S': '...',
        'T': '-',
        'U': '..-',
        'V': '...-',
        'W': '.--',
        'X': '-..-',
        'Y': '-.--',
        'Z': '--..',
        'А': '.-',
        'Б': '-...',
        'В': '.--',
        'Г': '--.',
        'Д': '-..',
        'Е': '.',
        'Ж': '...-',
        'З': '--..',
        'И': '..',
        'Й': '.---',
        'К': '-.-',
        'Л': '.-..',
        'М': '--',
        'Н': '-.',
        'О': '---',
        'П': '.--.',
        'Р': '.-.',
        'С': '...',
        'Т': '-',
        'У': '..-',
        'Ф': '..-.',
        'Х': '....',
        'Ц': '-.-.',
        'Ч': '---.',
        'Ш': '----',
        'Щ': '--.-',
        'Ъ': '.--.-.',
        'Ы': '-.--',
        'Ь': '-..-',
        'Э': '..-..',
        'Ю': '..--',
        'Я': '.-.-',
        ' ': ' ',
        '!': '--..--',
        ',': '.-.-.-',
        '.': '......',
        ':': '---...',
        '?': '..--..'
}


def encode_to_morse(text, sep='|'):
    text = text.upper()
    res = []
    for char in text:
        # Если символ в словаре, то добавляем в ответ код Морзе для символа. Иначе - ошибка
        if char in MorseCode:
            res.append(MorseCode[char])
        else:
            return f'Извините, непредвиденная ошибка! "{char}" невозможно перевести на Морзе'
    return sep.join(res)


def decode_from_morse(code, sep='|'):
    # Разделяем код по разделителю --> list
    code = code.split(sep)
    res = []
    for char in code:
        # Подбор ключа (буквы) среди пар "буква - Морзе"
        for key, value in MorseCode.items():
            if value == char:
                res.append(key)
                break
    # Вывод ответа
    return ''.join(res)


def main():
    print(r"""
  __  __                    
 |  \/  | ___  _ _  ___ ___ 
 | |\/| |/ _ \| '_||_ // -_)
 |_|  |_|\___/|_|  /__|\___|
    """)
    print('[1] Закодировать.')
    print('[2] Декодировать.')
    choice = input('Выберите опцию: ')
    if choice == "1":
        text = input('Пожалуйста, введите текст:\n')
        sep = input('Пожалуйста, введите разделитель для букв:\n')
        print('Вывод:\n')
        print(encode_to_morse(text=text, sep=sep))
    elif choice == "2":
        text = input('Пожалуйста, введите код:\n')
        sep = input('Пожалуйста, введите разделитель для букв:\n')
        print('Вывод:\n')
        print(decode_from_morse(code=text, sep=sep))


if __name__ == '__main__':
    main()
